{
  "testimonials": {
    "testimonial1": {
      "quote": "Having interested people to contact every month is exactly what I need",
      "date": "24th November 2020",
      "comment": "At Global.Media Marketing, we take pride in delivering results from our marketing campaigns for businesses. That is why we love hearing clients give us great feedback that service like our LinkedIn Lead Generation makes a difference to their company.\nWe love working with Didier at Say It With Champers (https://sayitwithchampers.co.uk) to get more businesses that can benefit from their corporate branded and personalized champagnes, prosecco and wines. Watch his lovely testimonial for GlobalDotMedia Marketing.",
      "author": "Testimonial by Didier Penine, Director, Say It With Champers"
    },
    "testimonial2": {
      "quote": "He’s brought sizable clients",
      "date": "4th March 2022",
      "comment": "It is always inspiring to hear our lovely clients tell the world about their experience of using Global.Media's LinkedIn Lead Generation service. We love working with Dan and https://thepodcastguys.co.uk to get new customers to benefit from their amazing podcasting services. Watch more Global.Media client testimonials @ https://globaldotmedia.com//testimonials",
      "author": "Testimonial by Dan and https://thepodcastguys.co.uk "
    },
    "testimonial3": {
      "quote": "Chris talks benefits of Charity fundraising on LinkedIn",
      "date": "21st February 2021",
      "comment": "Here at Global.Media we believe in giving back to our community. We work with great charities that do amazing work to support vulnerable people. We love working with Chris to support his YourSimPal charity work that supports people who have been diagnosed with cancer to overcome cancer poverty. Watch as he tells you the benefits our Linkedin lead generation has brought to their fundraising campaign. Check out Chris Cancer Community for his campaign work to support the cancer community.",
      "author": "Testimonial by Chris, YourSimPal Charity"
    },
    "testimonial4": {
      "quote": "Having interested people to contact every month is exactly what I need",
      "date": "24th November 2020",
      "comment": "At Global.Media Marketing, we take pride in delivering results from our marketing campaigns for businesses. That is why we love hearing clients give us great feedback that service like our LinkedIn Lead Generation makes a difference to their company.\nWe love working with Didier at Say It With Champers (https://sayitwithchampers.co.uk) to get more businesses that can benefit from their corporate branded and personalized champagnes, prosecco and wines. Watch his lovely testimonial for GlobalDotMedia Marketing.",
      "author": "Testimonial by Didier Penine, Director, Say It With Champers"
    },
    "testimonial5": {
      "quote": "You are doing a great job on our Instagram marketing",
      "date": "2nd November 2020",
      "comment": "Skinlight Cosmetics offers a range of fantastic skincare products that treat hyper-pigmentation, scars, the signs of ageing and hair loss. So it is a pleasure to manage their Instagram marketing that gets their products in front of people who benefit from their services.\nDavid and Tanya Furst (owners of Skinlight Cosmetics) show their appreciation for our great working relationship for the last three years. They also show appreciation for the branded and personalised champagne that we gave them as a thank you gift.\nDiscover Skinlight Costmetics @ https://www.skinlight.co.uk",
      "author": "Testimonial by David and Tanya Furst, Owners, Skinlight Cosmetics"
    },
    "testimonial6": {
      "quote": "Eny is the LinkedIn juggler",
      "date": "2nd November 2020",
      "comment": "We love happy clients telling the world about the difference that Global.Media's marketing services has made to their business. As Tom Crowley at BBX (Kent and South East) says \"Eny is the LinkedIn juggler\" - that is high praise that we appreciate at GlobalDotMedia. See our LinkedIn Lead Generation service",
      "author": "Testimonial by Tom Crowley, BBX"
    },
    "testimonial7": {
      "quote": "Fantastic corporate branded and personalised champagne",
      "date": "2nd November 2020",
      "comment": "I was looking for a thank you gift in the form of merchandise for the clients who stayed loyal to Global.Media marketing through the shock of the lockdown. I came across Say It With Champers. I liked the idea of having corporate branded premium champagne with our logo, personalised message on every bottle, and delivery options.\nAfter a quick chat with Didier (the Managing Director), I placed my order and sent my logo by email. It took a couple of email drafts of the label design for us to agree on the final look/branding. And the box of champagne arrived just over a week later.\nI highly recommend say it With Champers for your corporate-branded and personalised champagne, prosecco and wines because of their fantastic customer service, the ease to place an order, however bespoke your requirements, and very reasonable prices.\nI especially love the secure packaging with bubble wrap for each bottle to ensure the delivery arrived safely. And everyone has commented on the quality and great taste of the champagne. Thanks, Didier and the Say It With Champers Team",
      "author": "Testimonial by Global.Media"
    },
    "testimonial8": {
      "quote": "Helped us get more support and supporters in business",
      "date": "10th March 2020",
      "comment": "We are committed to playing an active part in our community. That is why supporting charities and not for profit organisations with our marketing and lead generation services is a vital part of our business activities. It is great to see Tamsin at Merlin MS Centre tell us that we are making a difference.",
      "author": "Testimonial by Tamsin Chapman, Fundraising and Digital Manager, Merlin MS Centre"
    },
    "testimonial9": {
      "quote": "Carry on doing what you are doing",
      "date": "12th January 2019",
      "comment": "Global.Media's Marketing Executive, Edera Diaz, works hard to provide clients with marketing services to sell more. Watch Neil's testimonial for the social media marketing services he has experienced to find out why we are the right marketing partners for your London & Cornish business. Contact us today to get started.",
      "author": "Testimonial by Neil, Regional Director, Business Networking Group"
    },
    "testimonial10": {
      "quote": "He delivers…he does exactly what he says he’s going to do!",
      "date": "3rd November 2018",
      "comment": "We love working with Gary at Capitol Bespoke Joinery. Global.Media has been working with Gary for 9 months now, proving social media marketing for his Bespoke Joinery Company based in Tadworth. Our marketing comprises organic daily posting and management of Facebook, LinkedIn and Twitter. We have also designed and managed Facebook ads campaigns for Capitol bespoke Joinery. Watch Gary tell you why he trusts Global.Media with his business' marketing and advertising to get new clients.",
      "author": "Testimonial by Gary Dawes, Owner"
    },
    "testimonial11": {
      "quote": "Great client from LinkedIn",
      "date": "3rd November 2018",
      "comment": "Peter, owner of Elite Interiors London, used his 60 seconds at BNI Sutton business networking to tell everyone about a great new client he got from Global.Media's LinkedIn marketing. In his words: 'If you want great social media marketing, talk to Eny'",
      "author": "Testimonial by Peter Webb, Owner"
    },
    "testimonial12": {
      "quote": "Highly recommend",
      "date": "3rd November 2018",
      "comment": "Jo runs an independent estate agency in Croydon, South London. Digital marketing is vital Hallways Properties to reach homeowners who want to sell and tenants looking for a home to rent. Watch her testimonial video about the difference Global.Media's social media marketing makes to her company",
      "author": "Testimonial by Jo Hall, Owner & Managing Director"
    },
    "testimonial13": {
      "quote": "Peter Webb testimonial for social media marketing service",
      "date": "26th February 2018",
      "comment": "Watch Peter's testimonial for http://globaldotmedia.com's social media marketing services and how we save him time while helping him to get more leads that turn into paying customers.\n\nGlobal.Media love working with Peter's bespoke cabinetry business, Elite Interiors London. Just as well because he likes the results he gets from our social media marketing - more visibility, time to do what he enjoys instead of social media posts, and more clients. Watch his testimonial about how our social media management and LinkedIn Lead Generation has helped him to build his Sutton business",
      "author": "Testimonial by Peter Webb, Owner, Elite Interiors London"
    },"testimonial14": {
      "quote": "Adrian testimonial for LinkedIn Lead Generation & Email Marketing services",
      "date": "3rd February 2018",
      "comment": "Adrian runs a DTT Removals & Clearance, a moving and domestic waste business in Croydon, South London. To say he was sceptical of the potential for LinkedIn to help his business get more clients is an understatement, not least because he invested a lot of time and effort on being visible on Facebook and more recently, Instagram. Global.Media's LinkedIn Lead Generation service and email newsletter marketing successfully got Adrian 8 prospective clients every month. They included his target clients - homeowners, developers and estate agents. Watch as Adrian shares his experience of our social media marketing service.\n\nWatch to discover why clients love our Advertising & Marketing services.\n\nThanks Adrian (http://dashthetrash.co.uk)\n\nAlso loving the testimonial video produced by Tommi (http://www.vouch4mevideo.com)",
      "author": "Testimonial by Adrian Thompson, Proprietor"
    },
    "testimonial15": {
      "quote": "Hannah Furbear Google Adwords Testimonial",
      "date": "26th December 2017",
      "comment": "Hannah runs a Beauty Treatments company, Belle Angelique Beauty. She approached Global.Media to help her to get more clients. We agreed on using Pay Per Click advertising on Facebook Ads and Google Adwords search ads as many people look for her services online. In the months that followed, Global.Media designed, launched and managed the adverts. We also created landing pages for each individual service so that visitors were more likely to convert into paying clients. Hannah tells you why she recommends Global.Media's marketing services\n\nBy Hannah Furbear, Owner Belle Angelique Beauty",
      "author": "Testimonial by Hannah Furbear, Owner"
    },
    "testimonial16": {
      "quote": "LinkedIn marketing experts",
      "date": "9th December 2017",
      "comment": "Testimonial for Mr Eny Osung - Small Biz Marketing now Global.Media.\n\nWe approached Global.Media because we required help targeting new customers via Linkedin and extending our online presence. Global.Media helped us by targeting our customers, connecting with them and booking calls and meetings with interested ones.\n\nThe results have been excellent and we have now connected with many people and businesses we probably wouldn’t have if we weren’t on Linkedin. Many connections have gone on to become clients, which is what marketing should do.\n\nOne thing we liked about Global.Media is their dedication and hard work finding us customers.\n\nWe found the whole experience very efficient.\n\nWe will be recommending Global.Media to people who are in need for more online marketing.\n\nRegards,\n\nAdrian Thompson\n\nProprietor, Dash The Trash Clearance Services",
      "author": "Testimonial by Adrian Thompson, Owner/http://Dashthetrash.co.uk"
    },
    "testimonial17": {
      "quote": "The right marketing",
      "date": "30th October 2017",
      "comment": "Ashley's business, Thawout Heating and Plumbing in Sutton is our ideal clients because we successfully get them in front of their target clients on social media channels. For his campaign, we provide Social Media Management which involves posting twice a day on LinkedIn, Facebook and Twitter. We also provided 150 connection requests a week to his target audience (property developers, landlords, estate agents and facilities management companies) in our LinkedIn Lead Generation service. Ashley explains why he recommends Global.Media's marketing services",
      "author": "Testimonial by Ashley Thaw, Managing Director"
    },
    "testimonial18": {
      "quote": "Saves me time and gets our language",
      "date": "15th October 2017",
      "comment": "Testimonial from Nick Swan, Managing Director of Lovewater.com Global.Media provided social media management, Google Adwords and set up and managed Google Merchant Shopping for his Gatwick-based business. Watch to discover his experience of doing business with us.",
      "author": "Testimonial by Nick Swan, Managing Director"
    },
    "testimonial19": {
      "quote": "Outstanding service",
      "date": "15th October 2017",
      "comment": "Global.Media enjoyed doing Gary, owner of Advanced Print Services, Coulsdon, social media marketing with twice daily postings on their Facebook, LinkedIn and Twitter pages, as well as LinkedIn Lead Generation to connect them with local businesses who require print and design services. We have also designed and managed their email marketing campaign that involved designing and sending monthly offers newsletter to his thousands of subscribers.",
      "author": "Testimonial by Gary Beckett, Proprietor"
    },
    "testimonial20": {
      "quote": "Marketing I would never have time to do",
      "date": "15th October 2017",
      "comment": "Global.Media has worked with Barbara, the Managing Director of Factorestudio, for several years now. Our marketing is largely social media management with twice daily posts to her social media pages (Facebook, LinkedIn, Google+ and Twitter. We have since added LinkedIn Lead generation to Barbara's marketing strategy. Our services have enabled her to get on with her work while maintaining a consistent and credible presence. Watch Barabara",
      "author": "Testimonial by Barbara Pilgrim, Owner"
    },
    "testimonial21": {
      "quote": "More productive thn other forms of marketing",
      "date": "15th October 2017",
      "comment": "More productive than other forms of marketing. Eny took control of the marketing for our networking group and without a shadow of a doubt he was able to engage with people and get them to come along to our meetings , this was more productive than other forms of marketing that the company had tried and at a lesser cost, many other companies want to post but don't want to engage , engagement was the key to building a following with potential attendees and made a big difference overall. Highly recommended. Keep up the good work Eny",
      "author": "Testimonial by Jason Hayles, Managing Director, Intel Protection Solutions (http://www.intelprotectionsolutions.co.uk/)"
    },
    "testimonial22": {
      "quote": "Very nice jobs have come in",
      "date": "15th October 2017",
      "comment": "Some nice jobs have come in. I met Eny through my local networking group and his services were exactly what I was looking for. With a recently dissolved business partnership under my belt, I soon realised how much time the admin was taking and my social media, where a lot of my business used to come from, was being put on the back burner. Eny explained to me how I should be using social media to my best advantage and helped me set up the platforms I'd never used or understood. I gave him access to my picture portfolio on Dropbox and within the week he was posting relevant and interesting posts, regularly to my network, with great success!! After the first month, I asked Eny to stop looking for new network connections for me as I'd become too busy to deal with them. I asked him to promote my online presence, via informative posts, relevant to my business and this happened quickly and easily without me needing to give Eny too much input. He understood my business. In the first three months of using Global Media I've had some very nice jobs come to fruition which have come from people I thought I knew reasonably well but, ridiculously, they had no idea what I sold. Thanks to the many and varied stories and pictures that Eny posted, these people found me. I can't recommend Eny highly enough. It sounds simple to 'just' post a few times a day to each social media platform but now I can be concentrating on other things while Eny deals with that for me. Thanks Eny. 🙂",
      "author": "Testimonial by Peter W, Owner, Elite Interiors London (http://eliteinteriorslondon.com/)"
    },
    "testimonial23": {
      "quote": "Numerous enquiries and bookings",
      "date": "9th October 2017",
      "comment": "I was recommended to Eny at Global.Media via a business networking event called BNI that my partner attends. I do a lot of my own marketing via social media, but thought I'd like to give Google Adwords a try, as I have met a few people who have built their business from just this method, so I thought I'd like to give it a go. I'm so glad I did decide to work with Eny as he was so helpful from day 1. We met and talked about what I wanted to achieve and I went through in detail with Eny what my business was about so he had a good understanding of what I did and what offered. Eny was very efficient and got the job done quickly and to a very high standard. To say I'm pleased is an understatement, the ads look professional and I've already had numerous enquiries, with a handful of bookings and this is only the beginning.\n\nI would highly recommend Eny and his services",
      "author": "Testimonial by Hannah Furbear",
      "website": "www.belleangeliquebeauty.co.uk"
    },
    "testimonial24": {
      "quote": "More Followers and likes transferring into sales",
      "date": "10th February 2017",
      "comment": "I just wanted to thank you for the good work you have been doing promoting Love Water on social media. You have got to understand the \"Love Water language\" and are posting news and stories in a very similar way to how I would like to do it if I had the time! And of course, this is where the real benefit of using your services are. You have saved me a huge amount of time. Our social media presence has improved significantly, with more \"Followers\" and \"Likes\" than ever before, which is transferring into enquiries and sales. Our new website is live, and I am really looking forward to you also taking on the organic and sponsored promotion of it. Of course, I would have no hesitation in recommending your services to another business.",
      "author": "Testimonial by Nick Swan",
      "website": "http://www.lovewater.com"
    },
    "testimonial25": {
      "quote": "Would recommend outsourcing social media and digital marketing",
      "date": "18th July 2016",
      "comment": "When it comes to social media and digital marketing, it's always hard for a small business to justify the costs. Eny Osung's simple and inexpensive services make it easy for small businesses to compete with larger companies. I would recommend that you consider outsourcing your social media and digital marketing.",
      "author": "Testimonial by Ashton-Paul Smythe, Managing Director, Ashton-Paul & Associates",
      "website": "http://ashton-paul.co.uk"
    },
    "testimonial26": {
      "quote": "Highly recommended",
      "date": "27th June 2016",
      "comment": "I would like to recommend the services of Eny Osung of Small Business eMarketing. He has helped me to develop my business from a start-up to a level that is now both profitable and viable. With his skill and enthusiasm, Eny has helped my business to grow to the stage where I will now be looking to further employ staff and apprentices. If you get the opportunity to work with Eny, you will soon realize that working with him and his unique organization will be the best business decision you ever made. I certainly did.",
      "author": "Testimonial by Jon Sims, Owner, Total Garden Services"
    },
    "testimonial27": {
      "quote": "From bottom of page to top of Google",
      "date": "27th June 2016",
      "comment": "I would like to thank you for advice and service with moving our marketing forward. As you know, we are a small and growing business and do not have the time or knowledge to ensure we present ourselves correctly in the digital social media marketplace. Your advice and the fact that you now do everything for us has been invaluable. In recent weeks, we have seen our company search results go from the bottom of page one to the top of Google. Amazing! You have also built up quite a following on Twitter by ensuring that we have regular and pertinent Twitter posts out daily, something we have never managed to achieve. We have absolutely no hesitation in recommending you to others, as we do on a frequent basis. Thank you again and kind regards.",
      "author": "Testimonial by Steve Bellamy, Managing Director, Bellcom Communications Ltd",
      "website": "http://bellcom.org"
    },
    "testimonial28": {
      "quote": "Outstanding Service",
      "date": "1st May 2016",
      "comment": "Thank you for helping me sort out my online marketing as I really haven't a clue when it comes down to the nitty-gritty. Within minutes of your sending my email campaign, an old customer we last saw three years ago bought more than £200 worth of printing. Everything has been at the price quoted, and the service outstanding.",
      "author": "Testimonial by Gary Beckett, Owner at Advanced Print Services, Coulsdon",
      "website": "http://www.advanced-print.com"
    },
    "testimonial29": {
      "quote": "Superior digital marketing",
      "date": "12th February 2016",
      "comment": "I’ve only known Eny for a few months but, in a very short period of time, he has impressed me immensely. Eny’s knowledge of digital marketing is unrivalled. Whether you are looking for a social media engagement strategy, support with SEO and/or PPC, email marketing, market research, or mobile marketing campaigns, Eny should be your first port of call. There are many digital marketing agencies/consultancies to pick from. However, Eny’s knowledge of this industry sector is superior to most. Eny has a unique approach with his clients, ensuring their expectations are exceeded. I particularly admire Eny’s positive, innovative, and forward-thinking attitude.",
      "author": "Testimonial by Jeremy R., SPORTS Marketing, Sponsorship, Advertising, Hospitality & Business Networking"
    },
    "testimonial30": {
      "quote": "Thanks for support, guidance and hard work",
      "date": "20th January 2016",
      "comment": "Eny was recommended to me by a friend when I wanted to start up my own business. I went to see him to discuss my plans when in reality I had an idea and very little in the way of a plan. We had a discussion on the phone beforehand about my idea, and a week later at our meeting, he knew more about the area than I did. We discussed some of the ideas I had for the vision of my business, some of which he was quite comfortable challenging, thank God!! He is honest and very insightful, giving direction when needed and highlighting your strengths while supporting your weaknesses. The business plan he sent me was outstanding and was accepted when put forward for the finance that was needed to get me started. Oh, I forgot to say, expect him to give you homework! He stretches your mind, gives you direction, and ensures that research around your given topic is the best it can be. Thank you, Eny, for all your support, guidance, and hard work.",
      "author": "Testimonial by Tarnia H., Nursing Home Manager"
    },
    "testimonial31": {
      "quote": "Awesome Digital Marketing",
      "date": "19th October 2015",
      "comment": "Union Sole employed the services of Smallbiz Emarketing Ltd to help the company develop an online marketing strategy and increase the number of customers/people visiting our website. On a monthly basis, the company increased the number of visitors, particularly through paid searches and content-based searches. We observed an improvement in our website's ranking on search engines like Google, appearing higher on the search pages. Additionally, there was a decrease in bounce rate and an increase in organic search rankings and visitors from organic search. Blogging on the website played a significant role in engaging customers and promoting our products. We are extremely satisfied with the awesome digital marketing services provided by Smallbiz Emarketing.",
      "author": "Testimonial by Rachael N., Director, Union Sole"
    },
    "testimonial32": {
      "quote": "Professional service",
      "date": "17th August 2015",
      "comment": "Lamiiro Limited contacted Smallbiz-emarketing again to complete market research for our recruitment service. We chose Smallbiz-emarketing based on their previous professional and comprehensive service for another branch of our company. The market research conducted by Smallbiz-emarketing covered advertising methods, costs, and a range of options that we had not previously considered. They also provided research on the recruitment sector, major players, and identified any gaps in the market. Additionally, Smallbiz-emarketing delivered a digital marketing proposal with projections and cost, presented in easy-to-follow spreadsheets. The research provided was instrumental in informing our business and marketing strategies for both online and offline channels. We highly appreciate the professional service provided by Smallbiz-emarketing.",
      "author": "Testimonial by Laila Ahmed, Director, Lamiiro Ltd"
    },
    "testimonial33": {
      "quote": "Online Marketing Planning Advice",
      "date": "17th August 2015",
      "comment": "Smallbiz-emarketing completed an in-depth and comprehensive online marketing plan for our Lingerie business. The representative from Smallbiz-emarketing contacted us promptly and arranged a face-to-face meeting to discuss our requirements. They came prepared with pre-existing research on the market industry, which allowed us to focus on the key aspects of our business during the meeting. We were impressed that the representative accommodated our scheduling needs and met us outside regular hours in our preferred location. The marketing plan provided by Smallbiz-emarketing covered various aspects such as competitors, market trends, products, pricing, digital marketing strategies, goals, and key performance indicators. The plan also included numerous suggestions to make Lamiiro Lingerie more sustainable. Based on the detailed marketing plan, we realized that continuing with the Lingerie section of our business would be too time-consuming at this current time. We appreciate the valuable online marketing planning advice provided by Smallbiz-emarketing.",
      "author": "Testimonial by Laila Ahmed, Director, Lamiiro Ltd"
    }
  }
}


